# Tech Nest Academy Assignment - 2

In [2]:
%load_ext sql

ModuleNotFoundError: No module named 'sql'

In [2]:
%sql sqlite://

## Q1. Write an SQL query to display the countries in 
## a)Ascending order
## b)Descending order
***CREATE TABLE COUNTRY(NAME VARCHAR2(30));<br>
INSERT INTO COUNTRY VALUES('INDIA');<br>
INSERT INTO COUNTRY VALUES('INDONESIA');<br>
INSERT INTO COUNTRY VALUES('NEPAL');<br>
INSERT INTO COUNTRY VALUES('CHINA');<br>
INSERT INTO COUNTRY VALUES('PAKISTAN');<br>
INSERT INTO COUNTRY VALUES('SRI LANKA');<br>
INSERT INTO COUNTRY VALUES('SINGAPORE');<br>
INSERT INTO COUNTRY VALUES('AFGHANISTAN');<br>
INSERT INTO COUNTRY VALUES('UNITED KINGDOM');<br>
INSERT INTO COUNTRY VALUES('RUSSIA');***

In [6]:
%sql CREATE TABLE COUNTRY(NAME VARCHAR2(30));INSERT INTO COUNTRY VALUES('INDIA');INSERT INTO COUNTRY VALUES('INDONESIA');INSERT INTO COUNTRY VALUES('NEPAL');INSERT INTO COUNTRY VALUES('CHINA');INSERT INTO COUNTRY VALUES('PAKISTAN');INSERT INTO COUNTRY VALUES('SRI LANKA');INSERT INTO COUNTRY VALUES('SINGAPORE');INSERT INTO COUNTRY VALUES('AFGHANISTAN');INSERT INTO COUNTRY VALUES('UNITED KINGDOM');INSERT INTO COUNTRY VALUES('RUSSIA');

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%sql select * from country;

 * sqlite://
Done.

[('INDIA',),
 ('INDONESIA',),
 ('NEPAL',),
 ('CHINA',),
 ('PAKISTAN',),
 ('SRI LANKA',),
 ('SINGAPORE',),
 ('AFGHANISTAN',),
 ('UNITED KINGDOM',),
 ('RUSSIA',)]

In [11]:
### solution

## (a)
%sql select * from country order by name asc;

 * sqlite://
Done.

[('AFGHANISTAN',),
 ('CHINA',),
 ('INDIA',),
 ('INDONESIA',),
 ('NEPAL',),
 ('PAKISTAN',),
 ('RUSSIA',),
 ('SINGAPORE',),
 ('SRI LANKA',),
 ('UNITED KINGDOM',)]

In [12]:
## (b)
%sql select * from country order by name desc;

 * sqlite://
Done.

[('UNITED KINGDOM',),
 ('SRI LANKA',),
 ('SINGAPORE',),
 ('RUSSIA',),
 ('PAKISTAN',),
 ('NEPAL',),
 ('INDONESIA',),
 ('INDIA',),
 ('CHINA',),
 ('AFGHANISTAN',)]

In [19]:
%sql drop table country;

 * sqlite://
Done.

[]

## Q2. Write an SQL query to display 'INDIA' at top and other countries in ascending order
## without hardcoding any integer/number/alphabet/string other than country name.<br>

***CREATE TABLE COUNTRY(NAME VARCHAR2(30));<br>
INSERT INTO COUNTRY VALUES('INDIA');<br>
INSERT INTO COUNTRY VALUES('INDONESIA');<br>
INSERT INTO COUNTRY VALUES('NEPAL');<br>
INSERT INTO COUNTRY VALUES('CHINA');<br>
INSERT INTO COUNTRY VALUES('PAKISTAN');<br>
INSERT INTO COUNTRY VALUES('SRI LANKA');<br>
INSERT INTO COUNTRY VALUES('SINGAPORE');<br>
INSERT INTO COUNTRY VALUES('AFGHANISTAN');<br>
INSERT INTO COUNTRY VALUES('UNITED KINGDOM');<br>
INSERT INTO COUNTRY VALUES('RUSSIA');***

In [20]:
### creating table
%sql CREATE TABLE COUNTRY(NAME VARCHAR2(30));INSERT INTO COUNTRY VALUES('INDIA');INSERT INTO COUNTRY VALUES('INDONESIA');INSERT INTO COUNTRY VALUES('NEPAL');INSERT INTO COUNTRY VALUES('CHINA');INSERT INTO COUNTRY VALUES('PAKISTAN');INSERT INTO COUNTRY VALUES('SRI LANKA');INSERT INTO COUNTRY VALUES('SINGAPORE');INSERT INTO COUNTRY VALUES('AFGHANISTAN');INSERT INTO COUNTRY VALUES('UNITED KINGDOM');INSERT INTO COUNTRY VALUES('RUSSIA');

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [23]:
%sql select * from country;

 * sqlite://
Done.

[('INDIA',),
 ('INDONESIA',),
 ('NEPAL',),
 ('CHINA',),
 ('PAKISTAN',),
 ('SRI LANKA',),
 ('SINGAPORE',),
 ('AFGHANISTAN',),
 ('UNITED KINGDOM',),
 ('RUSSIA',)]

## Solution

In [1]:
%sql select * from country order by case when name = 'INDIA' then ' ' else 2 end,name asc;

# only works on oracle sql server

UsageError: Line magic function `%sql` not found.

# Q3. which of the following statement is/are correct for the below query?
***select name from country<br>
order by <br>
case when name = 'INDIA' then 'a' else 'A' end,name desc;<br>
<br>
a)Throw error message<br>
b)INDIA will be displayed at last and remaining countries at top<br>
c)INDIA will be displayed at top and other remaining countries at bottom/last.<br>
d)Country names will be displayed but in random order.<br>***

In [33]:
# Solution
# (b)
%sql select name from country order by case when name = 'INDIA' then 'a' else 'A' end,name desc;

 * sqlite://
Done.

[('UNITED KINGDOM',),
 ('SRI LANKA',),
 ('SINGAPORE',),
 ('RUSSIA',),
 ('PAKISTAN',),
 ('NEPAL',),
 ('INDONESIA',),
 ('CHINA',),
 ('AFGHANISTAN',),
 ('INDIA',)]

In [34]:
%sql drop table country;

 * sqlite://
Done.

[]

# Q4. What should be the output of below query?
***select name from country<br>
order by <br>
case when name = 'INDIA' then 1 else 1 end,name;<br>
<br>
CREATE TABLE COUNTRY(NAME VARCHAR2(10));<br>
INSERT INTO COUNTRY VALUES('INDIA');<br>
INSERT INTO COUNTRY VALUES('NEPAL');<br>
INSERT INTO COUNTRY VALUES('CHINA');<br>
INSERT INTO COUNTRY VALUES('PAKISTAN');<br>
INSERT INTO COUNTRY VALUES('SRI LANKA');<br>
INSERT INTO COUNTRY VALUES('AFGHANISTAN');<br>
INSERT INTO COUNTRY VALUES('UNITED KINGDOM');<br>
INSERT INTO COUNTRY VALUES('RUSSIA');<br>***
***

In [36]:
# solution

%sql CREATE TABLE COUNTRY(NAME VARCHAR2(10));INSERT INTO COUNTRY VALUES('INDIA');INSERT INTO COUNTRY VALUES('NEPAL');INSERT INTO COUNTRY VALUES('CHINA');INSERT INTO COUNTRY VALUES('PAKISTAN');INSERT INTO COUNTRY VALUES('SRI LANKA');INSERT INTO COUNTRY VALUES('AFGHANISTAN');INSERT INTO COUNTRY VALUES('UNITED KINGDOM');INSERT INTO COUNTRY VALUES('RUSSIA');

%sql select name from country order by case when name = 'INDIA' then 1 else 1 end,name;

 * sqlite://
Done.

[('AFGHANISTAN',),
 ('CHINA',),
 ('INDIA',),
 ('NEPAL',),
 ('PAKISTAN',),
 ('RUSSIA',),
 ('SRI LANKA',),
 ('UNITED KINGDOM',)]

In [37]:
%sql drop table country;

 * sqlite://
Done.

[]

# Q5.Write an SQL query to dispay INDIA at last and all other countries sorted in ascending order.
***CREATE TABLE COUNTRY(NAME VARCHAR2(10));<br>
INSERT INTO COUNTRY VALUES('INDIA');<br>
INSERT INTO COUNTRY VALUES('NEPAL');<br>
INSERT INTO COUNTRY VALUES('CHINA');<br>
INSERT INTO COUNTRY VALUES('PAKISTAN');<br>
INSERT INTO COUNTRY VALUES('SRI LANKA');<br>
INSERT INTO COUNTRY VALUES('AFGHANISTAN');<br>
INSERT INTO COUNTRY VALUES('UNITED KINGDOM');<br>
INSERT INTO COUNTRY VALUES('RUSSIA');***

In [38]:
#solution

%sql CREATE TABLE COUNTRY(NAME VARCHAR2(10));INSERT INTO COUNTRY VALUES('INDIA');INSERT INTO COUNTRY VALUES('NEPAL');INSERT INTO COUNTRY VALUES('CHINA');INSERT INTO COUNTRY VALUES('PAKISTAN');INSERT INTO COUNTRY VALUES('SRI LANKA');INSERT INTO COUNTRY VALUES('AFGHANISTAN');INSERT INTO COUNTRY VALUES('UNITED KINGDOM');INSERT INTO COUNTRY VALUES('RUSSIA');

%sql select name from country order by case when name = 'INDIA' then 2 else 1 end,name asc;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[('AFGHANISTAN',),
 ('CHINA',),
 ('NEPAL',),
 ('PAKISTAN',),
 ('RUSSIA',),
 ('SRI LANKA',),
 ('UNITED KINGDOM',),
 ('INDIA',)]

In [39]:
%sql drop table country;

 * sqlite://
Done.

[]

# Q6.Write an SQL query to display the country name in below order.
<br>
CREATE TABLE COUNTRY(NAME VARCHAR2(10));<br>
INSERT INTO COUNTRY VALUES('INDIA');<br>
INSERT INTO COUNTRY VALUES('NEPAL');<br>
INSERT INTO COUNTRY VALUES('CHINA');<br>
INSERT INTO COUNTRY VALUES('PAKISTAN');<br>
INSERT INTO COUNTRY VALUES('SRI LANKA');<br>
INSERT INTO COUNTRY VALUES('RUSSIA');<br>
<br>

***O/p:<br>
NAME<br>
INDIA<br>
RUSSIA<br>
SRI LANKA<br>
PAKISTAN<br>
NEPAL<br>
CHINA<br>***

In [59]:
# solution

%sql CREATE TABLE COUNTRY(NAME VARCHAR2(10));INSERT INTO COUNTRY VALUES('INDIA');INSERT INTO COUNTRY VALUES('NEPAL');INSERT INTO COUNTRY VALUES('CHINA');INSERT INTO COUNTRY VALUES('PAKISTAN');INSERT INTO COUNTRY VALUES('SRI LANKA');INSERT INTO COUNTRY VALUES('RUSSIA');

%sql select name from country order by case when name ='INDIA'then 1 when name = 'RUSSIA' then 2 else 3 end,name desc;

 * sqlite://
Done.

[('INDIA',),
 ('RUSSIA',),
 ('SRI LANKA',),
 ('PAKISTAN',),
 ('NEPAL',),
 ('CHINA',)]

In [60]:
%sql drop table country;

 * sqlite://
Done.

[]

# Q7. Write an SQL query to display the firstname and lastname as per the below output.<br>
create table emp(firstname varchar2(50),lastname varchar2(50));<br>
insert into emp values('Raj','Kumar');<br>
insert into emp values('Raj','Kishore');<br>
insert into emp values('Abdul','Khan');<br>
insert into emp values('Asif','Sheikh');<br>
insert into emp values('Asif','Khan');<br>
<br>
***o/p:<br>
firstname   lastname<br>
Abdul       Khan<br>
Asif        Sheikh<br>
Asif        Khan<br>
Raj         Kumar<br>
Raj         Kishore***

In [52]:
# solution

%sql create table emp(firstname varchar2(50),lastname varchar2(50));insert into emp values('Raj','Kumar');insert into emp values('Raj','Kishore');insert into emp values('Abdul','Khan');insert into emp values('Asif','Sheikh');insert into emp values('Asif','Khan');

%sql select firstname,lastname from emp order by firstname , lastname desc;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[('Abdul', 'Khan'),
 ('Asif', 'Sheikh'),
 ('Asif', 'Khan'),
 ('Raj', 'Kumar'),
 ('Raj', 'Kishore')]

In [57]:
%sql drop table emp;

 * sqlite://
Done.

[]

# Q8.Write an SQL query to display the output as per below hierarchy but salary in descending order.<br>
Hierarchy:<br>
HOD<br>
Instructor<br>
Professor<br>
<br>
<br>
create table emp(id number,name varchar2(50),designation varchar2(50),salary number);<br>
insert into emp values(1,'Aman','HOD',400);<br>
insert into emp values(2,'Rajesh','HOD',500);<br>
<br>
insert into emp values(3,'Karan','Professor',800);<br>
insert into emp values(4,'Henry','Professor',300);<br>
<br>
insert into emp values(5,'Kunal','Instructor',400);<br>
insert into emp values(6,'Yusuf','Instructor',200);<br>
<br>
***o/p:
ID	NAME	DESIGNATION	 SALARY<br>
2	Rajesh	HOD	         500<br>
1	Aman	HOD	         400<br>
5	Kunal	Instructor	 400<br>
6	Yusuf	Instructor	 200<br>
3	Karan	Professor	 800<br>
4	Henry	Professor	 300***

In [61]:
# solution

%sql create table emp(id number,name varchar2(50),designation varchar2(50),salary number);insert into emp values(1,'Aman','HOD',400);insert into emp values(2,'Rajesh','HOD',500);insert into emp values(3,'Karan','Professor',800);insert into emp values(4,'Henry','Professor',300);insert into emp values(5,'Kunal','Instructor',400);insert into emp values(6,'Yusuf','Instructor',200);

%sql select * from emp order by case when designation = 'HOD' then 1 when designation = 'Instructor' then 2 else 3 end, salary desc;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[(2, 'Rajesh', 'HOD', 500),
 (1, 'Aman', 'HOD', 400),
 (5, 'Kunal', 'Instructor', 400),
 (6, 'Yusuf', 'Instructor', 200),
 (3, 'Karan', 'Professor', 800),
 (4, 'Henry', 'Professor', 300)]

In [63]:
%sql drop table emp;

 * sqlite://
Done.

[]

# Q9.Write a SQL query to fetch the employee details and sort the names in ascending order.<br>

***Create table employee(Firstname varchar2(20),lastname varchar2(20));<br>
insert into employee values('Raj','Kumar');<br>
insert into employee values('Raj','Karan');<br>
insert into employee values('Raj','Kishor');<br>
insert into employee values('Suraj','Mathor');<br>
insert into employee values('Suraj','Mukherjee');<br>
insert into employee values('Rohan','Sharma');<br>
insert into employee values('Rohit','Kumar');***

In [62]:
# solution

%sql Create table employee(Firstname varchar2(20),lastname varchar2(20));insert into employee values('Raj','Kumar');insert into employee values('Raj','Karan');insert into employee values('Raj','Kishor');insert into employee values('Suraj','Mathor');insert into employee values('Suraj','Mukherjee');insert into employee values('Rohan','Sharma');insert into employee values('Rohit','Kumar');

%sql select * from employee order by firstname ASC;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[('Raj', 'Kumar'),
 ('Raj', 'Karan'),
 ('Raj', 'Kishor'),
 ('Rohan', 'Sharma'),
 ('Rohit', 'Kumar'),
 ('Suraj', 'Mathor'),
 ('Suraj', 'Mukherjee')]

In [64]:
%sql drop table employee;

 * sqlite://
Done.

[]

# Q10. Which of the following statement is/are correct?

***a.By default order by sorts the result in ascending order.<br>
b.By default order by sorts the result in descending order.<br>
c.We must write asc or desc while using order by.<br>
d.To customise the sorting of result we can use case statement in order by.***

# solution 
a,d

# Q11.Write an SQL query to dispay INDIA at the top and all other countries sorted in ascending order without using else keyword.
***CREATE TABLE COUNTRY(NAME VARCHAR2(10));<br><br>
INSERT INTO COUNTRY VALUES('INDIA');<br>
INSERT INTO COUNTRY VALUES('NEPAL');<br>
INSERT INTO COUNTRY VALUES('CHINA');<br>
INSERT INTO COUNTRY VALUES('PAKISTAN');<br>
INSERT INTO COUNTRY VALUES('SRI LANKA');<br>
INSERT INTO COUNTRY VALUES('AFGHANISTAN');<br>
INSERT INTO COUNTRY VALUES('UNITED KINGDOM');<br>
INSERT INTO COUNTRY VALUES('RUSSIA');***

In [69]:
# solution

#%sql CREATE TABLE COUNTRY(NAME VARCHAR2(10));INSERT INTO COUNTRY VALUES('INDIA');INSERT INTO COUNTRY VALUES('NEPAL');INSERT INTO COUNTRY VALUES('CHINA');INSERT INTO COUNTRY VALUES('PAKISTAN');INSERT INTO COUNTRY VALUES('SRI LANKA');INSERT INTO COUNTRY VALUES('AFGHANISTAN');INSERT INTO COUNTRY VALUES('UNITED KINGDOM');INSERT INTO COUNTRY VALUES('RUSSIA');

%sql select * from country order by case when name = 'INDIA' then 1 end;

#without else is not working in sql server & sql lite but works in oracle sql server

 * sqlite://
Done.

[('NEPAL',),
 ('CHINA',),
 ('PAKISTAN',),
 ('SRI LANKA',),
 ('AFGHANISTAN',),
 ('UNITED KINGDOM',),
 ('RUSSIA',),
 ('INDIA',)]

In [70]:
%sql drop table country;

 * sqlite://
Done.

[]

# Q12. Write a SQL query to fetch the employee details and sort the names in ascending order in case of tie consider lastname ascending.
***Create table employee(Firstname varchar2(20),lastname varchar2(20));<br>
insert into employee values('Raj','Kumar');<br>
insert into employee values('Raj','Karan');<br>
insert into employee values('Raj','Kishor');<br>
insert into employee values('Suraj','Mathor');<br>
insert into employee values('Suraj','Mukherjee');<br>
insert into employee values('Rohan','Sharma');<br>
insert into employee values('Rohit','Kumar');***

In [71]:
# solution

%sql Create table employee(Firstname varchar2(20),lastname varchar2(20));insert into employee values('Raj','Kumar');insert into employee values('Raj','Karan');insert into employee values('Raj','Kishor');insert into employee values('Suraj','Mathor');insert into employee values('Suraj','Mukherjee');insert into employee values('Rohan','Sharma');insert into employee values('Rohit','Kumar');

%sql select * from employee order by firstname,lastname;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[('Raj', 'Karan'),
 ('Raj', 'Kishor'),
 ('Raj', 'Kumar'),
 ('Rohan', 'Sharma'),
 ('Rohit', 'Kumar'),
 ('Suraj', 'Mathor'),
 ('Suraj', 'Mukherjee')]

In [72]:
%sql drop table employee;

 * sqlite://
Done.

[]

# Q13. Write a SQL query to fetch the employee details and sort the lastname in descending order.

***Create table employee(Firstname varchar2(20),lastname varchar2(20));<br>
insert into employee values('Raj','Kumar');<br>
insert into employee values('Raj','Karan');<br>
insert into employee values('Raj','Kishor');<br>
insert into employee values('Suraj','Mathor');<br>
insert into employee values('Suraj','Mukherjee');<br>
insert into employee values('Rohan','Sharma');<br>
insert into employee values('Rohit','Kumar');***

In [73]:
# solution

%sql Create table employee(Firstname varchar2(20),lastname varchar2(20));insert into employee values('Raj','Kumar');insert into employee values('Raj','Karan');insert into employee values('Raj','Kishor');insert into employee values('Suraj','Mathor');insert into employee values('Suraj','Mukherjee');insert into employee values('Rohan','Sharma');insert into employee values('Rohit','Kumar');

%sql select * from employee order by lastname desc;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
 * sqlite://
Done.

[('Rohan', 'Sharma'),
 ('Suraj', 'Mukherjee'),
 ('Suraj', 'Mathor'),
 ('Raj', 'Kumar'),
 ('Rohit', 'Kumar'),
 ('Raj', 'Kishor'),
 ('Raj', 'Karan')]

# Q14. Write a SQL query to list the studname in ascending order but all the Female students should be displayed before all the Male students.

***create table stud(studid number,studname varchar2(20),Gender varchar2(5));<br>
insert into stud values(1,'Bilal','M');<br>
insert into stud values(2,'Suresh','M');<br>
insert into stud values(3,'Aman','M');<br>
insert into stud values(4,'Swati','F');<br>
<br>
insert into stud values(5,'Saurabh','M');<br>
insert into stud values(6,'Abdul','M');<br>
insert into stud values(7,'Ankit','M');<br>
insert into stud values(8,'Shruti','F');<br>
<br>
insert into stud values(9,'Ahmed','M');<br>
insert into stud values(10,'Anup','M');<br>
insert into stud values(11,'Rakesh','M');<br>
insert into stud values(12,'Neha','F');<br>
<br>
insert into stud values(13,'Suresh','M');<br>
insert into stud values(14,'Mukesh','M');<br>
insert into stud values(15,'Majid','M');<br>
insert into stud values(16,'Priyanka','F');***

In [75]:
# solution

#%sql create table stud(studid number,studname varchar2(20),Gender varchar2(5));insert into stud values(1,'Bilal','M');insert into stud values(2,'Suresh','M');insert into stud values(3,'Aman','M');insert into stud values(4,'Swati','F');insert into stud values(5,'Saurabh','M');insert into stud values(6,'Abdul','M');insert into stud values(7,'Ankit','M');insert into stud values(8,'Shruti','F');insert into stud values(9,'Ahmed','M');insert into stud values(10,'Anup','M');insert into stud values(11,'Rakesh','M');insert into stud values(12,'Neha','F');insert into stud values(13,'Suresh','M');insert into stud values(14,'Mukesh','M');insert into stud values(15,'Majid','M');insert into stud values(16,'Priyanka','F');

%sql select * from stud order by case when gender = 'F' then 1 else 2 end,studname asc;

 * sqlite://
Done.

[(12, 'Neha', 'F'),
 (16, 'Priyanka', 'F'),
 (8, 'Shruti', 'F'),
 (4, 'Swati', 'F'),
 (6, 'Abdul', 'M'),
 (9, 'Ahmed', 'M'),
 (3, 'Aman', 'M'),
 (7, 'Ankit', 'M'),
 (10, 'Anup', 'M'),
 (1, 'Bilal', 'M'),
 (15, 'Majid', 'M'),
 (14, 'Mukesh', 'M'),
 (11, 'Rakesh', 'M'),
 (5, 'Saurabh', 'M'),
 (2, 'Suresh', 'M'),
 (13, 'Suresh', 'M')]

In [76]:
%sql drop table stud;

 * sqlite://
Done.

[]